{"class_name": "Functional", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 2000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_19", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_3", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_3", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.14804282784461975, 0.1374824196100235, 0.0, 0.19900161027908325, 0.10395725071430206, 0.14958298206329346, 0.10000000149011612, 0.10000000149011612, 0.10000424832105637, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1631886214017868, 0.324557363986969, 0.0, 0.10000000149011612, 0.10356405377388, 0.17295919358730316, 0.0, 0.20432497560977936, 0.0, 0.2010054737329483, 0.10000000149011612, 0.10000000149011612, 0.13188990950584412, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.16816554963588715, 0.28383761644363403, 0.0, 0.3104862868785858, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.17319001257419586, 0.0, 0.0, 0.0, 0.16672922670841217, 0.0, 0.0, 0.0, 0.0, 0.0, 0.19325710833072662, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10078021883964539, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.2207217514514923, 0.10000000149011612, 0.1342925727367401, 0.10000000149011612, 0.14626848697662354, 0.0, 0.2312648892402649, 0.0, 0.15913993120193481, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10515359044075012, 0.2095191776752472, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.31925711035728455, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.19636069238185883, 0.25322866439819336, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.14628389477729797, 0.2975710332393646, 0.0, 0.10000000149011612, 0.0, 0.49543485045433044, 0.10000000149011612, 0.1837015599012375, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.15901724994182587, 0.10325448960065842, 0.10000000149011612, 0.10000000149011612, 0.12718990445137024, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1437949538230896, 0.34736424684524536, 0.3018569350242615, 0.0, 0.12021371722221375, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.16881677508354187, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10832918435335159, 0.0, 0.10000000149011612, 0.10872483253479004, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.12040163576602936, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.17928078770637512, 0.0, 0.10000000149011612, 0.32685935497283936, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.11837536841630936, 0.3505493402481079, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.3067893385887146, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1523069590330124, 0.0, 0.3070007264614105, 0.0, 0.22306233644485474, 0.0, 0.0, 0.15771484375, 0.13885147869586945, 0.0, 0.0, 0.0, 0.13488252460956573, 0.1570211946964264, 0.10000000149011612, 0.10000000149011612, 0.1358608454465866, 0.0, 0.10000000149011612, 0.0, 0.48608776926994324, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.3355322480201721, 0.10535804182291031, 0.10000000149011612, 0.2866966724395752, 0.0, 0.0, 0.0, 0.0, 0.11414176225662231, 0.10000000149011612, 0.17579108476638794, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1934943050146103, 0.0, 0.0, 0.10000000149011612, 0.0, 0.12911397218704224, 0.3350292146205902, 0.10000000149011612, 0.10000000149011612, 0.0, 0.2061813771724701, 0.10000000149011612, 0.10961922258138657, 0.0, 0.23106339573860168, 0.0, 0.22937342524528503, 0.0, 0.0, 0.49318835139274597, 0.10000000149011612, 0.0, 0.37805238366127014, 0.0, 0.33380088210105896, 0.14933636784553528, 0.16395507752895355, 0.10841692239046097, 0.10594576597213745, 0.0, 0.0, 0.11358968168497086, 0.22648079693317413, 0.15297359228134155, 0.0, 0.10000000149011612, 0.0, 0.0, 0.11681482195854187, 0.48311740159988403, 0.0, 0.10000000149011612, 0.10000000149011612, 0.3118828237056732, 0.4183133542537689, 0.10000000149011612, 0.15268376469612122, 0.0, 0.0, 0.10000000149011612, 0.0, 0.22717750072479248, 0.0, 0.29331111907958984, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.21989566087722778, 0.29398471117019653, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2054073065519333, 0.10000000149011612, 0.10000000149011612, 0.22326231002807617, 0.10000000149011612, 0.16587169468402863, 0.0, 0.10000000149011612, 0.10000000149011612, 0.22046515345573425, 0.17128275334835052, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.31175845861434937, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.11363454908132553, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.11568015068769455, 0.10000000149011612, 0.1319991946220398, 0.1180858239531517, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.28435274958610535, 0.2581205666065216, 0.2873019874095917, 0.18295633792877197, 0.156576469540596, 0.10000000149011612, 0.0, 0.16963961720466614, 0.0, 0.10000000149011612, 0.29791539907455444, 0.1464368999004364, 0.10000000149011612, 0.0, 0.0, 0.32714590430259705, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.1625816375017166, 0.353260338306427, 0.0, 0.3508051633834839, 0.10000000149011612, 0.46359795331954956, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1119203045964241, 0.10081829130649567, 0.10000000149011612, 0.18391568958759308, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.35047316551208496, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.45954370498657227, 0.10000000149011612, 0.12974588572978973, 0.24011598527431488, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10721008479595184, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2112545520067215, 0.11956218630075455, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10441423952579498, 0.10000000149011612, 0.2165098786354065, 0.10000000149011612, 0.2664702832698822, 0.2044258415699005, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1747654527425766, 0.1427576243877411, 0.0, 0.0, 0.0, 0.10000000149011612, 0.11541139334440231, 0.11542858928442001, 0.22132937610149384, 0.10000000149011612, 0.15834425389766693, 0.10000000149011612, 0.12172001600265503, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.18269018828868866, 0.12893928587436676, 0.14826521277427673, 0.25376439094543457, 0.23370929062366486, 0.10407348722219467, 0.16682615876197815, 0.0, 0.0, 0.0, 0.10161488503217697, 0.10000000149011612, 0.3619467616081238, 0.0, 0.31971678137779236, 0.1576531082391739, 0.11913605779409409, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.0, 0.18195116519927979, 0.10000000149011612, 0.3055383861064911, 0.19048668444156647, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.16988085210323334], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_3", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_3", "inbound_nodes": [["tf.math.subtract_3", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_3", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_3", "inbound_nodes": [["tf.math.pow_3", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_3", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_3", "inbound_nodes": [["tf.math.reduce_sum_3", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_3", "inbound_nodes": [["tf.math.reduce_mean_3", 0, 0, {"y": 5.858125615119934e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_3", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_3", "inbound_nodes": [[["tf.__operators__.add_3", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["tf.math.reduce_sum_3", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}