{"class_name": "Functional", "config": {"name": "model_14", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "name": "input_10", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_63", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_63", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_64", "trainable": true, "dtype": "float32", "units": 2000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_64", "inbound_nodes": [[["dense_63", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_49", "inbound_nodes": [[["dense_64", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_9", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_9", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.14709711074829102, 0.15179692208766937, 0.0, 0.20852667093276978, 0.10000000149011612, 0.19919423758983612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.15645527839660645, 0.42479854822158813, 0.0, 0.13298362493515015, 0.13098905980587006, 0.21938244998455048, 0.0, 0.2152850329875946, 0.0, 0.25241973996162415, 0.10000000149011612, 0.10000000149011612, 0.17198605835437775, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10556130856275558, 0.1844954788684845, 0.34384891390800476, 0.0, 0.3496384620666504, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.18365371227264404, 0.0, 0.0, 0.0, 0.2020479440689087, 0.0, 0.0, 0.0, 0.0, 0.0, 0.23571887612342834, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10894249379634857, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.12308371067047119, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.2159445434808731, 0.10000000149011612, 0.20558130741119385, 0.10000000149011612, 0.1460105925798416, 0.0, 0.26119598746299744, 0.0, 0.17756399512290955, 0.0, 0.11410341411828995, 0.0, 0.10179426521062851, 0.10000000149011612, 0.22579045593738556, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.38416048884391785, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.24573585391044617, 0.3039121627807617, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.1873232126235962, 0.29271724820137024, 0.0, 0.12499938905239105, 0.0, 0.5819388031959534, 0.10000000149011612, 0.1936672180891037, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.1758144199848175, 0.12875936925411224, 0.10000000149011612, 0.12830469012260437, 0.14110088348388672, 0.10000000149011612, 0.0, 0.10000000149011612, 0.20087802410125732, 0.38141486048698425, 0.37874358892440796, 0.0, 0.1613359898328781, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10366342961788177, 0.10000000149011612, 0.21567849814891815, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.11562837660312653, 0.0, 0.10000000149011612, 0.13883580267429352, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.13350822031497955, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.20474788546562195, 0.0, 0.10000000149011612, 0.4183019995689392, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.14988520741462708, 0.41082215309143066, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.32765334844589233, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.16444654762744904, 0.0, 0.35596486926078796, 0.0, 0.2532762289047241, 0.0, 0.0, 0.21677617728710175, 0.14688871800899506, 0.0, 0.0, 0.0, 0.1605534851551056, 0.1896311491727829, 0.10000000149011612, 0.10000000149011612, 0.15857897698879242, 0.0, 0.10000000149011612, 0.0, 0.5681686401367188, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10459336638450623, 0.10000000149011612, 0.40525442361831665, 0.13289231061935425, 0.11299765110015869, 0.38066545128822327, 0.0, 0.0, 0.0, 0.0, 0.1438993513584137, 0.0, 0.20463907718658447, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1794918030500412, 0.0, 0.0, 0.10000000149011612, 0.0, 0.16164147853851318, 0.3872418999671936, 0.10000000149011612, 0.0, 0.0, 0.20708920061588287, 0.12288351356983185, 0.12796352803707123, 0.0, 0.26925477385520935, 0.0, 0.2688845694065094, 0.0, 0.0, 0.6074318885803223, 0.10000000149011612, 0.0, 0.4294467866420746, 0.0, 0.401874840259552, 0.18747614324092865, 0.20656125247478485, 0.1511366069316864, 0.11895149946212769, 0.0, 0.0, 0.13420403003692627, 0.30371925234794617, 0.13792234659194946, 0.0, 0.0, 0.0, 0.0, 0.11891531199216843, 0.5245291590690613, 0.0, 0.10000000149011612, 0.10000000149011612, 0.37272945046424866, 0.5269886255264282, 0.10000000149011612, 0.15497532486915588, 0.0, 0.0, 0.10000000149011612, 0.0, 0.28416162729263306, 0.0, 0.33595263957977295, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.2437238097190857, 0.3003256916999817, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.23535645008087158, 0.10000000149011612, 0.10000000149011612, 0.2383837103843689, 0.10000000149011612, 0.17847611010074615, 0.0, 0.10000000149011612, 0.12269861251115799, 0.24491071701049805, 0.19542698562145233, 0.11166421324014664, 0.10000000149011612, 0.0, 0.10000000149011612, 0.3654041886329651, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1235748752951622, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.12660248577594757, 0.10000000149011612, 0.16067951917648315, 0.11757341027259827, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.30599677562713623, 0.26440438628196716, 0.31795603036880493, 0.24888452887535095, 0.16037186980247498, 0.10000000149011612, 0.0, 0.16485390067100525, 0.0, 0.10000000149011612, 0.36507394909858704, 0.15821029245853424, 0.10000000149011612, 0.0, 0.0, 0.36510753631591797, 0.0, 0.0, 0.0, 0.11165951937437057, 0.0, 0.0, 0.10000000149011612, 0.2246943712234497, 0.4192103147506714, 0.0, 0.412354439496994, 0.10000000149011612, 0.5190723538398743, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10645923763513565, 0.10000000149011612, 0.21176740527153015, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.3969387412071228, 0.10000000149011612, 0.0, 0.11170320957899094, 0.10000000149011612, 0.4923495054244995, 0.10000000149011612, 0.19950753450393677, 0.2908773422241211, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.27160507440567017, 0.16062244772911072, 0.10000000149011612, 0.10930000245571136, 0.0, 0.0, 0.10000000149011612, 0.10678385943174362, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.13353678584098816, 0.10000000149011612, 0.2505541443824768, 0.10000000149011612, 0.3085194230079651, 0.2573084831237793, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.20095078647136688, 0.14142824709415436, 0.0, 0.0, 0.0, 0.10000000149011612, 0.14023824036121368, 0.10446760058403015, 0.23325984179973602, 0.1031486913561821, 0.1730082482099533, 0.10000000149011612, 0.1526770442724228, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.2182636559009552, 0.14180059731006622, 0.16012471914291382, 0.31185078620910645, 0.24341976642608643, 0.15316979587078094, 0.1843453049659729, 0.0, 0.0, 0.0, 0.14436732232570648, 0.10000000149011612, 0.41283121705055237, 0.0, 0.33796295523643494, 0.19240789115428925, 0.11358385533094406, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.0, 0.2194932997226715, 0.10000000149011612, 0.3381304144859314, 0.20346760749816895, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.17346368730068207], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_9", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_9", "inbound_nodes": [["tf.math.subtract_9", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_9", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_9", "inbound_nodes": [["tf.math.pow_9", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_9", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_9", "inbound_nodes": [["tf.math.reduce_sum_9", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_9", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_9", "inbound_nodes": [["tf.math.reduce_mean_9", 0, 0, {"y": 5.858125615119934e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_9", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_9", "inbound_nodes": [[["tf.__operators__.add_9", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["tf.math.reduce_sum_9", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}