{"class_name": "Functional", "config": {"name": "model_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_37", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 2000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_38", "inbound_nodes": [[["dense_37", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_29", "inbound_nodes": [[["dense_38", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_5", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_5", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.18222516775131226, 0.17843416333198547, 0.0, 0.23782002925872803, 0.1189320981502533, 0.21691520512104034, 0.10000000149011612, 0.10000000149011612, 0.12224500626325607, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.19179461896419525, 0.46246206760406494, 0.0, 0.14555372297763824, 0.13989855349063873, 0.2419588267803192, 0.0, 0.2514452338218689, 0.0, 0.2762288451194763, 0.10000000149011612, 0.10000000149011612, 0.19454726576805115, 0.10000000149011612, 0.10000000149011612, 0.103058360517025, 0.10000000149011612, 0.20917832851409912, 0.3854292631149292, 0.0, 0.4003145098686218, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.21331819891929626, 0.0, 0.0, 0.0, 0.22690363228321075, 0.0, 0.0, 0.0, 0.0, 0.0, 0.25911203026771545, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.12674827873706818, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.1354963481426239, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.2572178244590759, 0.10000000149011612, 0.2128857970237732, 0.10000000149011612, 0.17523907124996185, 0.0, 0.29665857553482056, 0.0, 0.21102449297904968, 0.0, 0.1095331534743309, 0.0, 0.11185051500797272, 0.11140264570713043, 0.2631417214870453, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.42504069209098816, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.27626800537109375, 0.34076640009880066, 0.0, 0.0, 0.0, 0.10000000149011612, 0.0, 0.20395170152187347, 0.3541993796825409, 0.0, 0.13407884538173676, 0.0, 0.652553379535675, 0.10000000149011612, 0.2259780764579773, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.20059433579444885, 0.14351314306259155, 0.10000000149011612, 0.1409238874912262, 0.16162605583667755, 0.10000000149011612, 0.0, 0.10000000149011612, 0.21911998093128204, 0.4556080996990204, 0.41461265087127686, 0.0, 0.17557808756828308, 0.10417531430721283, 0.10000000149011612, 0.10000000149011612, 0.10918384790420532, 0.10464522987604141, 0.23934268951416016, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.13647951185703278, 0.0, 0.10000000149011612, 0.15594613552093506, 0.0, 0.0, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.15215964615345, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.2416446954011917, 0.0, 0.10000000149011612, 0.463051438331604, 0.0, 0.0, 0.1005512997508049, 0.10286509245634079, 0.1637701392173767, 0.464580237865448, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.37606924772262573, 0.0, 0.0, 0.0, 0.10000000149011612, 0.1171659603714943, 0.0, 0.1852121204137802, 0.0, 0.404703825712204, 0.0, 0.2921201288700104, 0.0, 0.0, 0.2295338660478592, 0.16842597723007202, 0.0, 0.0, 0.0, 0.18649275600910187, 0.21702414751052856, 0.10000000149011612, 0.10000000149011612, 0.186197891831398, 0.0, 0.10000000149011612, 0.0, 0.6404627561569214, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.11806070804595947, 0.10000000149011612, 0.45008376240730286, 0.14654898643493652, 0.12244464457035065, 0.41492804884910583, 0.0, 0.0, 0.0, 0.0, 0.157080739736557, 0.0, 0.2342655509710312, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.22310246527194977, 0.0, 0.0, 0.10000000149011612, 0.0, 0.1730734258890152, 0.43774646520614624, 0.10000000149011612, 0.0, 0.0, 0.2404850870370865, 0.12524005770683289, 0.1392556130886078, 0.0, 0.3097296357154846, 0.0, 0.29849112033843994, 0.0, 0.0, 0.6704950332641602, 0.10390481352806091, 0.0, 0.4865937829017639, 0.0, 0.4448031485080719, 0.2113116830587387, 0.23060403764247894, 0.15990540385246277, 0.13435772061347961, 0.0, 0.0, 0.14343886077404022, 0.3271040618419647, 0.16558270156383514, 0.0, 0.0, 0.0, 0.0, 0.13931600749492645, 0.6037218570709229, 0.0, 0.10000000149011612, 0.10000000149011612, 0.41235360503196716, 0.5813465714454651, 0.10000000149011612, 0.176164910197258, 0.0, 0.0, 0.10000000149011612, 0.0, 0.312309205532074, 0.0, 0.374837726354599, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.28221508860588074, 0.36543548107147217, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2678399682044983, 0.10000000149011612, 0.10000000149011612, 0.28124383091926575, 0.10000000149011612, 0.20707657933235168, 0.0, 0.10000000149011612, 0.13365446031093597, 0.28950852155685425, 0.22739499807357788, 0.11518403887748718, 0.0, 0.0, 0.10492336750030518, 0.4107401967048645, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1415388286113739, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.1493886411190033, 0.10000000149011612, 0.17699293792247772, 0.13711440563201904, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.3524795174598694, 0.3100806474685669, 0.3739180862903595, 0.2724303901195526, 0.1880774199962616, 0.10000000149011612, 0.0, 0.2033359259366989, 0.0, 0.10000000149011612, 0.4028233587741852, 0.17349663376808167, 0.10000000149011612, 0.0, 0.0, 0.41843244433403015, 0.0, 0.0, 0.0, 0.13024455308914185, 0.0, 0.0, 0.10000000149011612, 0.24504253268241882, 0.4662089943885803, 0.0, 0.46157100796699524, 0.10000000149011612, 0.595461368560791, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.12594722211360931, 0.0, 0.2333424836397171, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.45685404539108276, 0.10000000149011612, 0.0, 0.1281605362892151, 0.10000000149011612, 0.5780484080314636, 0.10000000149011612, 0.20766475796699524, 0.3340388536453247, 0.0, 0.0, 0.0, 0.0, 0.11564735323190689, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2929166257381439, 0.1710217297077179, 0.10000000149011612, 0.11377234011888504, 0.0, 0.0, 0.10000000149011612, 0.10911679267883301, 0.10000000149011612, 0.0, 0.0, 0.0, 0.1504286527633667, 0.10000000149011612, 0.2751326560974121, 0.10000000149011612, 0.3450138568878174, 0.2795542776584625, 0.0, 0.10000000149011612, 0.10243988782167435, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.22850382328033447, 0.1770576536655426, 0.0, 0.0, 0.0, 0.10000000149011612, 0.15395207703113556, 0.1288105696439743, 0.2733596861362457, 0.12303739786148071, 0.19978466629981995, 0.10000000149011612, 0.16775387525558472, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.25139111280441284, 0.17327964305877686, 0.18818241357803345, 0.3515505790710449, 0.2853599786758423, 0.1589563935995102, 0.20934166014194489, 0.0, 0.0, 0.0, 0.1571144163608551, 0.10000000149011612, 0.4686458706855774, 0.0, 0.40099209547042847, 0.20663227140903473, 0.14339224994182587, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.0, 0.24279460310935974, 0.10000000149011612, 0.39088305830955505, 0.22814425826072693, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.212270125746727], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_5", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_5", "inbound_nodes": [["tf.math.subtract_5", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_5", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_5", "inbound_nodes": [["tf.math.pow_5", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_5", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_5", "inbound_nodes": [["tf.math.reduce_sum_5", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_5", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_5", "inbound_nodes": [["tf.math.reduce_mean_5", 0, 0, {"y": 5.858125615119934e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_5", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_5", "inbound_nodes": [[["tf.__operators__.add_5", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["tf.math.reduce_sum_5", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}