{"class_name": "Functional", "config": {"name": "model_44", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_30"}, "name": "input_30", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_193", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_193", "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_194", "trainable": true, "dtype": "float32", "units": 1280, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_194", "inbound_nodes": [[["dense_193", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_149", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_149", "inbound_nodes": [[["dense_194", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_149", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_29", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_29", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.2843540608882904, 0.0, 0.12644881010055542, 0.10000000149011612, 0.15870234370231628, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10856930166482925, 0.29455989599227905, 0.10000000149011612, 0.3395622670650482, 0.0, 0.10000000149011612, 0.10000000149011612, 0.4066504240036011, 0.15225636959075928, 0.0, 0.1787348836660385, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.2876115143299103, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.4702739715576172, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2366204410791397, 0.0, 0.0, 0.36009886860847473, 0.10000000149011612, 0.13328221440315247, 0.0, 0.13112057745456696, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.18024756014347076, 0.15822240710258484, 0.10000000149011612, 0.0, 0.12898370623588562, 0.10000000149011612, 0.11105578392744064, 0.13973358273506165, 0.0, 0.24251943826675415, 0.10000000149011612, 0.0, 0.10000000149011612, 0.15744569897651672, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.16963234543800354, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.14806438982486725, 0.0, 0.31286710500717163, 0.10000000149011612, 0.11459413170814514, 0.10000000149011612, 0.16164816915988922, 0.10000000149011612, 0.14118576049804688, 0.10000000149011612, 0.3193027675151825, 0.42105114459991455, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2644594609737396, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.13938553631305695, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.18940772116184235, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.35710692405700684, 0.1714368760585785, 0.0, 0.10000000149011612, 0.1810789257287979, 0.2303994745016098, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.23677925765514374, 0.10000000149011612, 0.12351915240287781, 0.16927912831306458, 0.17546340823173523, 0.10000000149011612, 0.0, 0.30087748169898987, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1597672402858734, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1420072764158249, 0.2131790667772293, 0.14405378699302673, 0.10000000149011612, 0.1867876499891281, 0.10000000149011612, 0.0, 0.0, 0.11235665529966354, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.18281416594982147, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.20438329875469208, 0.10000000149011612, 0.10000000149011612, 0.11174440383911133, 0.2785533666610718, 0.23010797798633575, 0.0, 0.3684285581111908, 0.10000000149011612, 0.0, 0.10000000149011612, 0.3012651205062866, 0.10000000149011612, 0.10000000149011612, 0.3598553538322449, 0.0, 0.3379211127758026, 0.10000000149011612, 0.12912911176681519, 0.10000000149011612, 0.10509443283081055, 0.2303011268377304, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.24994881451129913, 0.4833042323589325, 0.22689752280712128, 0.0, 0.3916689157485962, 0.0, 0.10000000149011612, 0.10931073129177094, 0.19289696216583252, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.13554221391677856, 0.10000000149011612, 0.10000000149011612, 0.2646268904209137, 0.10000000149011612, 0.4272254705429077, 0.2704683840274811, 0.14340154826641083, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1490241140127182, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.12353620678186417, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.12178899347782135, 0.10000000149011612, 0.3287813365459442, 0.0, 0.0, 0.2351667732000351, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.11475209146738052, 0.0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_29", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_29", "inbound_nodes": [["tf.math.subtract_29", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_29", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_29", "inbound_nodes": [["tf.math.pow_29", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_29", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_29", "inbound_nodes": [["tf.math.reduce_sum_29", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_29", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_29", "inbound_nodes": [["tf.math.reduce_mean_29", 0, 0, {"y": 4.72099928855896e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_29", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_29", "inbound_nodes": [[["tf.__operators__.add_29", 0, 0, {}]]]}], "input_layers": [["input_30", 0, 0]], "output_layers": [["tf.math.reduce_sum_29", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}