{"class_name": "Functional", "config": {"name": "model_35", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_24"}, "name": "input_24", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_154", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_154", "inbound_nodes": [[["input_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_155", "trainable": true, "dtype": "float32", "units": 1280, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_155", "inbound_nodes": [[["dense_154", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_119", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_119", "inbound_nodes": [[["dense_155", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_119", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_23", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_23", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.11471276730298996, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.19936512410640717, 0.10000000149011612, 0.10550491511821747, 0.10000000149011612, 0.24629367887973785, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.31120356917381287, 0.0, 0.16953277587890625, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.16892845928668976, 0.38355207443237305, 0.10000000149011612, 0.3761526048183441, 0.0, 0.10000000149011612, 0.17305831611156464, 0.45407599210739136, 0.11540699750185013, 0.10000000149011612, 0.20538058876991272, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.18921689689159393, 0.11053764075040817, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.6294257640838623, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.18327127397060394, 0.0, 0.0, 0.5276134014129639, 0.10000000149011612, 0.19591766595840454, 0.0, 0.10000000149011612, 0.11464666575193405, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.15438984334468842, 0.10000000149011612, 0.25558802485466003, 0.2498755156993866, 0.10000000149011612, 0.0, 0.16003023087978363, 0.10000000149011612, 0.11630161106586456, 0.10000000149011612, 0.0, 0.14159075915813446, 0.10000000149011612, 0.0, 0.10000000149011612, 0.2134484350681305, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1460796743631363, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.19199399650096893, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.1258304864168167, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.16472618281841278, 0.10000000149011612, 0.4117017984390259, 0.10000000149011612, 0.18677088618278503, 0.17118507623672485, 0.1679919809103012, 0.10000000149011612, 0.11625845730304718, 0.10000000149011612, 0.31139659881591797, 0.4707268476486206, 0.15239384770393372, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.3306589424610138, 0.14148564636707306, 0.10606551915407181, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.15618692338466644, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10186554491519928, 0.0, 0.10000000149011612, 0.21310296654701233, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.42042386531829834, 0.28601840138435364, 0.10000000149011612, 0.10000000149011612, 0.12718358635902405, 0.2764056324958801, 0.18664143979549408, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.19603732228279114, 0.1892620027065277, 0.10000000149011612, 0.2191464751958847, 0.3018525242805481, 0.1992085576057434, 0.10000000149011612, 0.0, 0.19653616845607758, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.275452584028244, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.13501586019992828, 0.11602578312158585, 0.10000000149011612, 0.0, 0.10000000149011612, 0.18529288470745087, 0.2789255976676941, 0.20886868238449097, 0.10000000149011612, 0.19989828765392303, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1895589381456375, 0.10000000149011612, 0.26989731192588806, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.11311882734298706, 0.0, 0.10000000149011612, 0.10000000149011612, 0.3526482582092285, 0.10000000149011612, 0.10000000149011612, 0.15201954543590546, 0.2708991765975952, 0.3301374316215515, 0.0, 0.3323870897293091, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2711341679096222, 0.10000000149011612, 0.10000000149011612, 0.43215274810791016, 0.0, 0.41341668367385864, 0.10000000149011612, 0.1028088703751564, 0.11069705337285995, 0.15046466886997223, 0.12862586975097656, 0.10000000149011612, 0.10000000149011612, 0.11898744851350784, 0.10000000149011612, 0.0, 0.1888936460018158, 0.3441040515899658, 0.20567971467971802, 0.0, 0.3964102268218994, 0.0, 0.10000000149011612, 0.19228704273700714, 0.23587165772914886, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.11950194090604782, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.13713675737380981, 0.10000000149011612, 0.10000000149011612, 0.20384939014911652, 0.10000000149011612, 0.4818899929523468, 0.37040629982948303, 0.2941269874572754, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1631091684103012, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1282593309879303, 0.10000000149011612, 0.0, 0.10000000149011612, 0.11140666902065277, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.41197219491004944, 0.0, 0.0, 0.2871188521385193, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.14145563542842865, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_23", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_23", "inbound_nodes": [["tf.math.subtract_23", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_23", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_23", "inbound_nodes": [["tf.math.pow_23", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_23", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_23", "inbound_nodes": [["tf.math.reduce_sum_23", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_23", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_23", "inbound_nodes": [["tf.math.reduce_mean_23", 0, 0, {"y": 4.72099928855896e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_23", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_23", "inbound_nodes": [[["tf.__operators__.add_23", 0, 0, {}]]]}], "input_layers": [["input_24", 0, 0]], "output_layers": [["tf.math.reduce_sum_23", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}