{"class_name": "Functional", "config": {"name": "model_32", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_22"}, "name": "input_22", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_141", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_141", "inbound_nodes": [[["input_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_142", "trainable": true, "dtype": "float32", "units": 1280, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_142", "inbound_nodes": [[["dense_141", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_109", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_109", "inbound_nodes": [[["dense_142", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_109", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_21", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_21", "inbound_nodes": [["net_output", 0, 0, {"y": [0.10000000149011612, 0.13071587681770325, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.32385972142219543, 0.10000000149011612, 0.1695701777935028, 0.10464160889387131, 0.3944529891014099, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.12723015248775482, 0.0, 0.13238106667995453, 0.3254808485507965, 0.0, 0.2047707587480545, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.23262815177440643, 0.46764323115348816, 0.13289792835712433, 0.41913893818855286, 0.0, 0.11566422879695892, 0.26140859723091125, 0.4923403859138489, 0.10000000149011612, 0.10000000149011612, 0.21788622438907623, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.12865644693374634, 0.2088342010974884, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.7950031757354736, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.12089873105287552, 0.10000000149011612, 0.14790765941143036, 0.0, 0.0, 0.6195339560508728, 0.10000000149011612, 0.24197691679000854, 0.0, 0.10000000149011612, 0.1328015774488449, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.2318127155303955, 0.10000000149011612, 0.30929505825042725, 0.3663768768310547, 0.10000000149011612, 0.0, 0.18352167308330536, 0.10000000149011612, 0.12143784761428833, 0.10000000149011612, 0.0, 0.10000000149011612, 0.11113514006137848, 0.10000000149011612, 0.10167235136032104, 0.2679189443588257, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.18282458186149597, 0.12303607910871506, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.23246562480926514, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.1672668159008026, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.20929020643234253, 0.10000000149011612, 0.4791105091571808, 0.10000000149011612, 0.21805556118488312, 0.242994025349617, 0.18930864334106445, 0.10000000149011612, 0.10023800283670425, 0.10000000149011612, 0.296436607837677, 0.5404996871948242, 0.20076049864292145, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.14986220002174377, 0.42110303044319153, 0.20436182618141174, 0.14788039028644562, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.19333471357822418, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.11686632037162781, 0.0, 0.10000000149011612, 0.24128389358520508, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.49081549048423767, 0.4110274910926819, 0.0, 0.10000000149011612, 0.10000000149011612, 0.3484835922718048, 0.2906462252140045, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.27712976932525635, 0.1707528978586197, 0.10000000149011612, 0.327717661857605, 0.37204858660697937, 0.20354121923446655, 0.0, 0.0, 0.13744741678237915, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.415998637676239, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.16089294850826263, 0.20356814563274384, 0.18683290481567383, 0.10000000149011612, 0.0, 0.10000000149011612, 0.23558171093463898, 0.3464552164077759, 0.24275442957878113, 0.10000000149011612, 0.22975961863994598, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.29572540521621704, 0.10000000149011612, 0.3070540428161621, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.12754128873348236, 0.0, 0.11732690036296844, 0.10000000149011612, 0.48064130544662476, 0.10000000149011612, 0.10000000149011612, 0.20530296862125397, 0.2822900116443634, 0.40854260325431824, 0.10000000149011612, 0.3408520519733429, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.24439619481563568, 0.10000000149011612, 0.10000000149011612, 0.49088022112846375, 0.0, 0.4911153018474579, 0.10000000149011612, 0.10000000149011612, 0.14808981120586395, 0.20202063024044037, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.16863279044628143, 0.10000000149011612, 0.0, 0.12805770337581635, 0.2864660322666168, 0.1720948964357376, 0.0, 0.4280139207839966, 0.0, 0.10000000149011612, 0.23789596557617188, 0.27251794934272766, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.13587617874145508, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.13881835341453552, 0.10000000149011612, 0.10000000149011612, 0.16441194713115692, 0.1246272400021553, 0.5089970231056213, 0.4784756004810333, 0.4416297376155853, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1813470721244812, 0.0, 0.11230441927909851, 0.10000000149011612, 0.0, 0.1430879831314087, 0.18266414105892181, 0.10000000149011612, 0.0, 0.10000000149011612, 0.11755217611789703, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.49159929156303406, 0.0, 0.0, 0.37985941767692566, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.2269207388162613, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_21", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_21", "inbound_nodes": [["tf.math.subtract_21", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_21", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_21", "inbound_nodes": [["tf.math.pow_21", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_21", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_21", "inbound_nodes": [["tf.math.reduce_sum_21", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_21", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_21", "inbound_nodes": [["tf.math.reduce_mean_21", 0, 0, {"y": 4.72099928855896e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_21", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_21", "inbound_nodes": [[["tf.__operators__.add_21", 0, 0, {}]]]}], "input_layers": [["input_22", 0, 0]], "output_layers": [["tf.math.reduce_sum_21", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}