{"class_name": "Functional", "config": {"name": "model_41", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_28"}, "name": "input_28", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_180", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_180", "inbound_nodes": [[["input_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_181", "trainable": true, "dtype": "float32", "units": 1280, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_181", "inbound_nodes": [[["dense_180", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_139", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_139", "inbound_nodes": [[["dense_181", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_139", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_27", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_27", "inbound_nodes": [["net_output", 0, 0, {"y": [0.10000000149011612, 0.10000000149011612, 0.22282910346984863, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.23259304463863373, 0.11033054441213608, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.5187007784843445, 0.0, 0.10232577472925186, 0.10082294046878815, 0.4312497079372406, 0.10000000149011612, 0.0, 0.0, 0.0, 0.1578367054462433, 0.0, 0.10000000149011612, 0.16679956018924713, 0.5271720290184021, 0.13215917348861694, 0.6683444380760193, 0.0, 0.10000000149011612, 0.10000000149011612, 0.7945567965507507, 0.3045407235622406, 0.10000000149011612, 0.16447684168815613, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.7426028847694397, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.5990870594978333, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.5158659815788269, 0.0, 0.0, 0.46368327736854553, 0.10000000149011612, 0.17125311493873596, 0.0, 0.31724995374679565, 0.10000000149011612, 0.0, 0.0, 0.1885094791650772, 0.24303194880485535, 0.10000000149011612, 0.10000000149011612, 0.30755144357681274, 0.15920144319534302, 0.20160062611103058, 0.0, 0.10903546214103699, 0.10000000149011612, 0.10000000149011612, 0.27354902029037476, 0.0, 0.4435959756374359, 0.10000000149011612, 0.0, 0.0, 0.22008273005485535, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.1865403801202774, 0.11056824773550034, 0.10000000149011612, 0.10980993509292603, 0.14733371138572693, 0.12071189284324646, 0.0, 0.10947729647159576, 0.0, 0.0, 0.3063652217388153, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.342259019613266, 0.0, 0.0, 0.10000000149011612, 0.24703696370124817, 0.0, 0.5759274959564209, 0.0, 0.24021384119987488, 0.17681385576725006, 0.231084942817688, 0.12123517692089081, 0.22926440834999084, 0.10000000149011612, 0.6724473834037781, 0.6172063946723938, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.17825059592723846, 0.28263139724731445, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.20067834854125977, 0.10000000149011612, 0.10000000149011612, 0.33361750841140747, 0.10000000149011612, 0.15041574835777283, 0.1704845428466797, 0.0, 0.0, 0.10000000149011612, 0.18087513744831085, 0.10000000149011612, 0.10000000149011612, 0.0, 0.16707156598567963, 0.0, 0.10000000149011612, 0.0, 0.0, 0.33141717314720154, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.5055652856826782, 0.15434347093105316, 0.0, 0.0, 0.2764908969402313, 0.41750675439834595, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1109725683927536, 0.10691878944635391, 0.10000000149011612, 0.37776827812194824, 0.0, 0.10000000149011612, 0.19661079347133636, 0.21423842012882233, 0.10000000149011612, 0.0, 0.5379964113235474, 0.10000000149011612, 0.10000000149011612, 0.10749303549528122, 0.12676942348480225, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.3675169348716736, 0.17582589387893677, 0.13842228055000305, 0.10000000149011612, 0.24381601810455322, 0.0, 0.0, 0.0, 0.31702685356140137, 0.10000000149011612, 0.0, 0.13709045946598053, 0.10000000149011612, 0.10000000149011612, 0.24992604553699493, 0.10000000149011612, 0.17287029325962067, 0.10000000149011612, 0.19372346997261047, 0.0, 0.16922956705093384, 0.0, 0.15854281187057495, 0.2015657126903534, 0.10000000149011612, 0.12055537849664688, 0.33741632103919983, 0.24753572046756744, 0.10000000149011612, 0.6224113702774048, 0.12766464054584503, 0.10000000149011612, 0.10000000149011612, 0.6401081085205078, 0.10000000149011612, 0.0, 0.5256009697914124, 0.0, 0.3661811053752899, 0.10000000149011612, 0.35809770226478577, 0.11301670223474503, 0.20811255276203156, 0.7122660875320435, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.4860224723815918, 0.9450666308403015, 0.38380300998687744, 0.0, 0.5324515104293823, 0.0, 0.27892032265663147, 0.26471543312072754, 0.4144569933414459, 0.10000000149011612, 0.12589454650878906, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.1891540139913559, 0.1236790344119072, 0.1476716250181198, 0.605233371257782, 0.10000000149011612, 0.656635582447052, 0.40358173847198486, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.11686792224645615, 0.10000000149011612, 0.0, 0.31575989723205566, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.18515215814113617, 0.0, 0.10000000149011612, 0.25800880789756775, 0.11534574627876282, 0.23387667536735535, 0.19063572585582733, 0.2978565990924835, 0.0, 0.0, 0.44012629985809326, 0.0, 0.0, 0.1593082696199417, 0.10000000149011612, 0.1679033637046814, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.16999676823616028, 0.0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_27", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_27", "inbound_nodes": [["tf.math.subtract_27", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_27", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_27", "inbound_nodes": [["tf.math.pow_27", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_27", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_27", "inbound_nodes": [["tf.math.reduce_sum_27", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_27", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_27", "inbound_nodes": [["tf.math.reduce_mean_27", 0, 0, {"y": 4.72099928855896e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_27", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_27", "inbound_nodes": [[["tf.__operators__.add_27", 0, 0, {}]]]}], "input_layers": [["input_28", 0, 0]], "output_layers": [["tf.math.reduce_sum_27", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}