{"class_name": "Functional", "config": {"name": "model_38", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_26"}, "name": "input_26", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_167", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_167", "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_168", "trainable": true, "dtype": "float32", "units": 1280, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_168", "inbound_nodes": [[["dense_167", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_129", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_129", "inbound_nodes": [[["dense_168", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_129", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_25", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_25", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.12038301676511765, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.15546445548534393, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2204475849866867, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2899000346660614, 0.0, 0.16942347586154938, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1438978612422943, 0.33208394050598145, 0.10000000149011612, 0.33768561482429504, 0.10000000149011612, 0.10000000149011612, 0.15206082165241241, 0.4070100784301758, 0.11860748380422592, 0.10000000149011612, 0.21712081134319305, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.17534925043582916, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.6034085154533386, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.17430147528648376, 0.0, 0.10000000149011612, 0.48001131415367126, 0.10000000149011612, 0.17253483831882477, 0.0, 0.10000000149011612, 0.11731517314910889, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.12947461009025574, 0.10000000149011612, 0.21770404279232025, 0.22516541182994843, 0.10000000149011612, 0.0, 0.16387559473514557, 0.10032730549573898, 0.12681394815444946, 0.10000000149011612, 0.0, 0.170959934592247, 0.10000000149011612, 0.0, 0.10000000149011612, 0.19193145632743835, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1473453789949417, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1778937131166458, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1257738620042801, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.15971970558166504, 0.0, 0.3533831834793091, 0.10000000149011612, 0.14490142464637756, 0.12854284048080444, 0.1708320677280426, 0.10000000149011612, 0.12803778052330017, 0.10000000149011612, 0.2850109934806824, 0.4660791754722595, 0.11534233391284943, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.32088738679885864, 0.13089711964130402, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.15519815683364868, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10269369184970856, 0.0, 0.10000000149011612, 0.202874556183815, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.41116076707839966, 0.26866665482521057, 0.10000000149011612, 0.10000000149011612, 0.14622919261455536, 0.24940744042396545, 0.16462251543998718, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.16855952143669128, 0.19676706194877625, 0.10000000149011612, 0.19715683162212372, 0.26883837580680847, 0.20027504861354828, 0.10000000149011612, 0.0, 0.22724853456020355, 0.10000000149011612, 0.0, 0.10000000149011612, 0.252951979637146, 0.10000000149011612, 0.0, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10260755568742752, 0.10603267699480057, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1479625105857849, 0.27911391854286194, 0.19891420006752014, 0.10000000149011612, 0.19913017749786377, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.1392776519060135, 0.10000000149011612, 0.24240629374980927, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.31848660111427307, 0.10000000149011612, 0.10000000149011612, 0.14249251782894135, 0.2904001474380493, 0.31192371249198914, 0.0, 0.3487504720687866, 0.10000000149011612, 0.0, 0.10000000149011612, 0.2567698061466217, 0.10000000149011612, 0.10000000149011612, 0.4187218248844147, 0.0, 0.41825056076049805, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.12494935840368271, 0.10604523122310638, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.1923859566450119, 0.37144070863723755, 0.20392048358917236, 0.0, 0.4176674783229828, 0.0, 0.10000000149011612, 0.13530854880809784, 0.2017962634563446, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.14031913876533508, 0.10000000149011612, 0.10000000149011612, 0.19994932413101196, 0.10000000149011612, 0.47480836510658264, 0.3437969386577606, 0.2655908465385437, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.15003205835819244, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10819026082754135, 0.0, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.4157082438468933, 0.10000000149011612, 0.0, 0.25240159034729004, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.1210731491446495, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_25", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_25", "inbound_nodes": [["tf.math.subtract_25", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_25", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_25", "inbound_nodes": [["tf.math.pow_25", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_25", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_25", "inbound_nodes": [["tf.math.reduce_sum_25", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_25", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_25", "inbound_nodes": [["tf.math.reduce_mean_25", 0, 0, {"y": 4.72099928855896e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_25", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_25", "inbound_nodes": [[["tf.__operators__.add_25", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0]], "output_layers": [["tf.math.reduce_sum_25", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}