{"class_name": "Functional", "config": {"name": "model_47", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_32"}, "name": "input_32", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_206", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_206", "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_207", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_207", "inbound_nodes": [[["dense_206", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_159", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_159", "inbound_nodes": [[["dense_207", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_159", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_31", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_31", "inbound_nodes": [["net_output", 0, 0, {"y": [0.10000000149011612, 0.10000000149011612, 0.10763229429721832, 0.24009808897972107, 0.10000000149011612, 0.1564883440732956, 0.5428619980812073, 0.4469417929649353, 0.10000000149011612, 0.10000000149011612, 0.3300376832485199, 0.2936432361602783, 0.24308136105537415, 0.17488767206668854, 0.4952327311038971, 0.2503107488155365, 0.10000000149011612, 0.11820832639932632, 0.10000000149011612, 0.24162723124027252, 0.18785853683948517, 0.10000000149011612, 0.10000000149011612, 0.18042698502540588, 0.38337162137031555, 0.615386962890625, 0.10000000149011612, 0.11732266843318939, 0.6266223788261414, 0.14765295386314392, 0.398430198431015, 0.10000000149011612, 0.878304660320282, 0.20139561593532562, 0.21980397403240204, 0.21222224831581116, 0.0, 1.0121482610702515, 0.11839280277490616, 0.29351016879081726, 0.3068568706512451, 0.40377479791641235, 0.10000000149011612, 0.7071791887283325, 0.27461713552474976, 0.34940817952156067, 0.0, 0.10000000149011612, 0.4314563572406769, 0.10000000149011612, 0.10000000149011612, 0.0, 0.8116389513015747, 0.10000000149011612, 0.11096343398094177, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.8941754102706909, 0.10000000149011612, 0.5024623274803162, 0.10000000149011612, 0.19950728118419647, 0.4053244888782501, 0.1670965999364853, 0.9057987928390503, 0.10000000149011612, 0.10000000149011612, 0.17635971307754517, 0.40085217356681824, 0.162770077586174, 0.9404597282409668, 0.10000000149011612, 0.10000000149011612, 0.33471861481666565, 0.12510769069194794, 0.2218281775712967, 0.10000000149011612, 0.3858577609062195, 0.1387140303850174], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_31", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_31", "inbound_nodes": [["tf.math.subtract_31", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_31", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_31", "inbound_nodes": [["tf.math.pow_31", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_31", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_31", "inbound_nodes": [["tf.math.reduce_sum_31", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_31", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_31", "inbound_nodes": [["tf.math.reduce_mean_31", 0, 0, {"y": 2.446925890445709e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_31", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_31", "inbound_nodes": [[["tf.__operators__.add_31", 0, 0, {}]]]}], "input_layers": [["input_32", 0, 0]], "output_layers": [["tf.math.reduce_sum_31", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}