{"class_name": "Functional", "config": {"name": "model_56", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_38"}, "name": "input_38", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_245", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_245", "inbound_nodes": [[["input_38", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_246", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_246", "inbound_nodes": [[["dense_245", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_189", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_189", "inbound_nodes": [[["dense_246", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_189", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_37", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_37", "inbound_nodes": [["net_output", 0, 0, {"y": [0.14319728314876556, 0.19736243784427643, 0.23046104609966278, 0.19746169447898865, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.11290355771780014, 0.0, 0.10000000149011612, 0.45708274841308594, 0.40321779251098633, 0.10000000149011612, 0.10000000149011612, 0.8710901141166687, 0.36841171979904175, 0.10000000149011612, 0.23123863339424133, 0.10000000149011612, 0.4619351327419281, 0.25715747475624084, 0.10000000149011612, 0.0, 0.37526586651802063, 0.21453501284122467, 0.3413905203342438, 0.10000000149011612, 0.10000000149011612, 0.6969316005706787, 0.10000000149011612, 0.4133100211620331, 0.2649230659008026, 0.9813884496688843, 0.1435437947511673, 0.10000000149011612, 0.15104469656944275, 0.0, 0.9498696327209473, 0.2123849093914032, 0.27282440662384033, 0.1041790023446083, 0.10000000149011612, 0.10000000149011612, 0.48281797766685486, 0.44792458415031433, 0.2963007986545563, 0.0, 0.144178107380867, 0.13278557360172272, 0.3105074465274811, 0.10000000149011612, 0.0, 0.5861470699310303, 0.10000000149011612, 0.3351082503795624, 0.10000000149011612, 0.24488131701946259, 0.10000000149011612, 0.8665231466293335, 0.10000000149011612, 0.3724399507045746, 0.16955147683620453, 0.3578287661075592, 0.36329779028892517, 0.10000000149011612, 0.9971873164176941, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.8205305933952332, 0.30739203095436096, 0.8207375407218933, 0.10000000149011612, 0.10000000149011612, 0.17653875052928925, 0.35343658924102783, 0.4728144407272339, 0.10000000149011612, 0.9311769008636475, 0.3308000862598419], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_37", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_37", "inbound_nodes": [["tf.math.subtract_37", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_37", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_37", "inbound_nodes": [["tf.math.pow_37", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_37", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_37", "inbound_nodes": [["tf.math.reduce_sum_37", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_37", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_37", "inbound_nodes": [["tf.math.reduce_mean_37", 0, 0, {"y": 2.446925890445709e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_37", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_37", "inbound_nodes": [[["tf.__operators__.add_37", 0, 0, {}]]]}], "input_layers": [["input_38", 0, 0]], "output_layers": [["tf.math.reduce_sum_37", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}