{"class_name": "Functional", "config": {"name": "model_50", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_34"}, "name": "input_34", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_219", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_219", "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_220", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_220", "inbound_nodes": [[["dense_219", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_169", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_169", "inbound_nodes": [[["dense_220", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_169", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_33", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_33", "inbound_nodes": [["net_output", 0, 0, {"y": [0.10000000149011612, 0.10000000149011612, 0.12932881712913513, 0.23000609874725342, 0.10000000149011612, 0.10000000149011612, 0.3792695105075836, 0.3081705868244171, 0.10000000149011612, 0.10057750344276428, 0.260343998670578, 0.2087351232767105, 0.21156658232212067, 0.10712596029043198, 0.4190576374530792, 0.21316908299922943, 0.10000000149011612, 0.12386911362409592, 0.10000000149011612, 0.2220710664987564, 0.12440245598554611, 0.10000000149011612, 0.10000000149011612, 0.18503686785697937, 0.2732323706150055, 0.4577421545982361, 0.10000000149011612, 0.10000000149011612, 0.417766809463501, 0.16853804886341095, 0.2680618166923523, 0.10000000149011612, 0.6731166839599609, 0.16265451908111572, 0.23481647670269012, 0.2043311446905136, 0.0, 0.7389112710952759, 0.10000000149011612, 0.27152419090270996, 0.24609655141830444, 0.2825843095779419, 0.10000000149011612, 0.4914548397064209, 0.18251033127307892, 0.23563174903392792, 0.0, 0.10000000149011612, 0.28525882959365845, 0.10000000149011612, 0.10000000149011612, 0.0, 0.6426775455474854, 0.10407555103302002, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.7520996332168579, 0.10000000149011612, 0.3272491991519928, 0.10000000149011612, 0.1398233026266098, 0.2911033630371094, 0.1642141044139862, 0.5978984236717224, 0.10000000149011612, 0.10000000149011612, 0.17196884751319885, 0.2594548463821411, 0.1232958659529686, 0.66588294506073, 0.10000000149011612, 0.10000000149011612, 0.3373950123786926, 0.1007651761174202, 0.16776986420154572, 0.10000000149011612, 0.3145003318786621, 0.1025654748082161], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_33", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_33", "inbound_nodes": [["tf.math.subtract_33", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_33", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_33", "inbound_nodes": [["tf.math.pow_33", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_33", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_33", "inbound_nodes": [["tf.math.reduce_sum_33", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_33", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_33", "inbound_nodes": [["tf.math.reduce_mean_33", 0, 0, {"y": 2.446925890445709e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_33", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_33", "inbound_nodes": [[["tf.__operators__.add_33", 0, 0, {}]]]}], "input_layers": [["input_34", 0, 0]], "output_layers": [["tf.math.reduce_sum_33", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}