{"class_name": "Functional", "config": {"name": "model_53", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_36"}, "name": "input_36", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_232", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_232", "inbound_nodes": [[["input_36", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_233", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_233", "inbound_nodes": [[["dense_232", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_179", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_179", "inbound_nodes": [[["dense_233", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_179", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_35", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_35", "inbound_nodes": [["net_output", 0, 0, {"y": [0.10936343669891357, 0.1552009880542755, 0.41467055678367615, 0.3541873097419739, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.5636780261993408, 0.38095033168792725, 0.10000000149011612, 0.10000000149011612, 1.3047089576721191, 0.6569430828094482, 0.10000000149011612, 0.41735661029815674, 0.10000000149011612, 0.5960943698883057, 0.2681480944156647, 0.10000000149011612, 0.0, 0.627892792224884, 0.14840847253799438, 0.2713085412979126, 0.11114349961280823, 0.10000000149011612, 0.6909976601600647, 0.10000000149011612, 0.49177461862564087, 0.3588546812534332, 1.1520785093307495, 0.15234233438968658, 0.10000000149011612, 0.1846613883972168, 0.0, 1.1161744594573975, 0.19439612329006195, 0.4434807598590851, 0.12286199629306793, 0.10000000149011612, 0.10000000149011612, 0.37287187576293945, 0.5772230625152588, 0.21717630326747894, 0.0, 0.18769218027591705, 0.10000000149011612, 0.2660299837589264, 0.1405174434185028, 0.0, 0.6542227864265442, 0.10000000149011612, 0.4584985673427582, 0.0, 0.25709399580955505, 0.10000000149011612, 1.080049753189087, 0.11441127210855484, 0.3627256155014038, 0.14632341265678406, 0.3827876150608063, 0.531146764755249, 0.10000000149011612, 1.1003719568252563, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 1.1035994291305542, 0.3813023865222931, 0.9413551092147827, 0.0, 0.10000000149011612, 0.13321952521800995, 0.5764808654785156, 0.5562349557876587, 0.10000000149011612, 1.2452024221420288, 0.5310787558555603], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_35", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_35", "inbound_nodes": [["tf.math.subtract_35", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_35", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_35", "inbound_nodes": [["tf.math.pow_35", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_35", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_35", "inbound_nodes": [["tf.math.reduce_sum_35", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_35", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_35", "inbound_nodes": [["tf.math.reduce_mean_35", 0, 0, {"y": 2.446925890445709e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_35", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_35", "inbound_nodes": [[["tf.__operators__.add_35", 0, 0, {}]]]}], "input_layers": [["input_36", 0, 0]], "output_layers": [["tf.math.reduce_sum_35", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}