{"class_name": "Functional", "config": {"name": "model_59", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_40"}, "name": "input_40", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_258", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_258", "inbound_nodes": [[["input_40", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_259", "trainable": true, "dtype": "float32", "units": 320, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_259", "inbound_nodes": [[["dense_258", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_199", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_199", "inbound_nodes": [[["dense_259", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_199", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_39", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_39", "inbound_nodes": [["net_output", 0, 0, {"y": [0.17948497831821442, 0.25963956117630005, 0.23561927676200867, 0.20858456194400787, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.5311861634254456, 0.47162848711013794, 0.10000000149011612, 0.10000000149011612, 0.9597318172454834, 0.37617212533950806, 0.10000000149011612, 0.2328323870897293, 0.10000000149011612, 0.5177817940711975, 0.30886805057525635, 0.10000000149011612, 0.0, 0.4102458357810974, 0.18490538001060486, 0.33845001459121704, 0.10000000149011612, 0.10000000149011612, 0.7905462980270386, 0.10000000149011612, 0.46320652961730957, 0.3198022246360779, 1.0902774333953857, 0.10000000149011612, 0.10000000149011612, 0.11756574362516403, 0.0, 1.0009690523147583, 0.2520938515663147, 0.25999388098716736, 0.10000000149011612, 0.10000000149011612, 0.0, 0.5040915012359619, 0.5528230667114258, 0.3122556209564209, 0.0, 0.17746253311634064, 0.10000000149011612, 0.3757975101470947, 0.10000000149011612, 0.0, 0.6163823008537292, 0.0, 0.4289115071296692, 0.0, 0.328636109828949, 0.10000000149011612, 0.9181362390518188, 0.10000000149011612, 0.3715589940547943, 0.21095503866672516, 0.4328475296497345, 0.39961010217666626, 0.10000000149011612, 1.126219391822815, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 1.0114052295684814, 0.3845321536064148, 0.8735330104827881, 0.0, 0.10000000149011612, 0.16115343570709229, 0.409805566072464, 0.5548603534698486, 0.10000000149011612, 1.1249803304672241, 0.40821659564971924], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_39", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_39", "inbound_nodes": [["tf.math.subtract_39", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_39", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_39", "inbound_nodes": [["tf.math.pow_39", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_39", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_39", "inbound_nodes": [["tf.math.reduce_sum_39", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_39", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_39", "inbound_nodes": [["tf.math.reduce_mean_39", 0, 0, {"y": 2.446925890445709e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_39", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_39", "inbound_nodes": [[["tf.__operators__.add_39", 0, 0, {}]]]}], "input_layers": [["input_40", 0, 0]], "output_layers": [["tf.math.reduce_sum_39", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}