{"class_name": "Functional", "config": {"name": "model_65", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_44"}, "name": "input_44", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_284", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_284", "inbound_nodes": [[["input_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_285", "trainable": true, "dtype": "float32", "units": 720, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_285", "inbound_nodes": [[["dense_284", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_219", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_219", "inbound_nodes": [[["dense_285", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_219", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_43", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_43", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.10000000149011612, 0.15956953167915344, 0.0, 0.10000000149011612, 0.5893954634666443, 0.0, 0.0, 0.10000000149011612, 0.33580267429351807, 0.8184778690338135, 0.0, 0.46646687388420105, 0.42390429973602295, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10869164764881134, 0.10000000149011612, 0.26472172141075134, 0.7600951194763184, 0.2607690095901489, 0.6447833776473999, 0.130109965801239, 0.20411416888237, 0.18363119661808014, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.22112902998924255, 0.0, 0.1360863298177719, 0.0, 0.0, 0.10000000149011612, 0.0, 0.48227253556251526, 0.0, 0.11577066779136658, 0.10000000149011612, 0.16107219457626343, 0.1909724622964859, 0.2920873165130615, 0.10000000149011612, 0.23721110820770264, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.5924108028411865, 0.1401858627796173, 0.0, 0.10000000149011612, 0.20551370084285736, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.25123879313468933, 0.10000000149011612, 0.10000000149011612, 0.2978377938270569, 0.10000000149011612, 0.0, 0.6339823007583618, 0.0, 0.19419950246810913, 0.3633608818054199, 0.44103726744651794, 0.0, 0.0, 0.10000000149011612, 0.43569275736808777, 0.0, 0.10000000149011612, 0.23527610301971436, 0.0, 0.0, 0.0, 0.0, 0.15817207098007202, 0.7384797930717468, 0.18431051075458527, 0.6923553943634033, 0.0, 0.1733502596616745, 0.0, 0.15403448045253754, 0.0, 0.10000000149011612, 0.10000000149011612, 0.48812857270240784, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.4147701859474182, 0.41735076904296875, 0.10000000149011612, 0.0, 0.1521131694316864, 0.70263671875, 0.10000000149011612, 0.10142828524112701, 0.828531801700592, 0.10000000149011612, 0.32155314087867737, 0.6101694703102112, 0.10000000149011612, 0.10000000149011612, 0.4160204827785492, 0.10000000149011612, 0.0, 0.20580238103866577, 0.0, 0.1892760992050171, 0.3496624529361725, 0.18568935990333557, 0.0, 0.2068692445755005, 0.4444738030433655, 0.0, 0.10000000149011612, 0.0, 0.151434525847435, 0.541543185710907, 0.4940621256828308, 0.0, 0.4391605854034424, 0.0, 0.37917500734329224, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.7019674181938171, 0.10000000149011612, 0.16749541461467743, 0.10000000149011612, 0.2229030430316925, 0.11823321133852005, 0.13499505817890167, 0.10000000149011612, 0.19794541597366333, 0.10000000149011612, 0.2703706920146942, 0.5860984325408936, 0.31365102529525757, 0.10000000149011612, 0.2918882966041565, 0.0, 0.18909700214862823, 0.7451285123825073, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.0, 0.3273606598377228, 0.10000000149011612, 0.0, 0.1313154250383377, 0.0, 0.10000000149011612, 0.8931503891944885, 0.45405304431915283, 0.21290044486522675, 0.19451238214969635, 0.0, 0.0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_43", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_43", "inbound_nodes": [["tf.math.subtract_43", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_43", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_43", "inbound_nodes": [["tf.math.pow_43", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_43", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_43", "inbound_nodes": [["tf.math.reduce_sum_43", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_43", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_43", "inbound_nodes": [["tf.math.reduce_mean_43", 0, 0, {"y": 3.592578065395355e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_43", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_43", "inbound_nodes": [[["tf.__operators__.add_43", 0, 0, {}]]]}], "input_layers": [["input_44", 0, 0]], "output_layers": [["tf.math.reduce_sum_43", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}