{"class_name": "Functional", "config": {"name": "model_62", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_42"}, "name": "input_42", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_271", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_271", "inbound_nodes": [[["input_42", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_272", "trainable": true, "dtype": "float32", "units": 720, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_272", "inbound_nodes": [[["dense_271", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_209", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_209", "inbound_nodes": [[["dense_272", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_209", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_41", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_41", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.10000000149011612, 0.1506091058254242, 0.10000000149011612, 0.10000000149011612, 0.37465426325798035, 0.10000000149011612, 0.0, 0.10000000149011612, 0.17711742222309113, 0.3439720571041107, 0.10000000149011612, 0.37615257501602173, 0.37599271535873413, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.149210587143898, 0.10000000149011612, 0.10000000149011612, 0.2818259596824646, 0.10000000149011612, 0.10000000149011612, 0.3690873682498932, 0.19269998371601105, 0.4984288215637207, 0.10000000149011612, 0.15725742280483246, 0.1550247073173523, 0.17014703154563904, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2367759495973587, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1479860097169876, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.13472823798656464, 0.24820038676261902, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.36006152629852295, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.2646568715572357, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.13400739431381226, 0.10000000149011612, 0.10000000149011612, 0.15108352899551392, 0.10000000149011612, 0.10000000149011612, 0.4398353397846222, 0.0, 0.10000000149011612, 0.12222874909639359, 0.24021466076374054, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1434074342250824, 0.0, 0.10000000149011612, 0.18325358629226685, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.365416944026947, 0.10000000149011612, 0.41632431745529175, 0.0, 0.10000000149011612, 0.0, 0.2075471431016922, 0.10000000149011612, 0.14738470315933228, 0.10000000149011612, 0.35814619064331055, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1541619449853897, 0.39313721656799316, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.5428377985954285, 0.10000000149011612, 0.10000000149011612, 0.6797794103622437, 0.10000000149011612, 0.20567616820335388, 0.17082440853118896, 0.10000000149011612, 0.10000000149011612, 0.19638213515281677, 0.10000000149011612, 0.10000000149011612, 0.1682814061641693, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.21006600558757782, 0.10000000149011612, 0.10000000149011612, 0.28100135922431946, 0.0, 0.10000000149011612, 0.0, 0.19168323278427124, 0.3311818242073059, 0.3140903115272522, 0.0, 0.41937434673309326, 0.10000000149011612, 0.2270500659942627, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.3335842490196228, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10354778915643692, 0.10000000149011612, 0.10000000149011612, 0.18022561073303223, 0.10000000149011612, 0.10000000149011612, 0.34669938683509827, 0.1254071444272995, 0.13970783352851868, 0.16073821485042572, 0.0, 0.25183627009391785, 0.5738734006881714, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.22771623730659485, 0.10000000149011612, 0.0, 0.20628292858600616, 0.10000000149011612, 0.10000000149011612, 0.6392027139663696, 0.1761789470911026, 0.15094886720180511, 0.28119826316833496, 0.0, 0.10000000149011612], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_41", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_41", "inbound_nodes": [["tf.math.subtract_41", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_41", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_41", "inbound_nodes": [["tf.math.pow_41", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_41", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_41", "inbound_nodes": [["tf.math.reduce_sum_41", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_41", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_41", "inbound_nodes": [["tf.math.reduce_mean_41", 0, 0, {"y": 3.592578065395355e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_41", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_41", "inbound_nodes": [[["tf.__operators__.add_41", 0, 0, {}]]]}], "input_layers": [["input_42", 0, 0]], "output_layers": [["tf.math.reduce_sum_41", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}