{"class_name": "Functional", "config": {"name": "model_71", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_48"}, "name": "input_48", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_310", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_310", "inbound_nodes": [[["input_48", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_311", "trainable": true, "dtype": "float32", "units": 720, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_311", "inbound_nodes": [[["dense_310", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_239", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_239", "inbound_nodes": [[["dense_311", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_239", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_47", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_47", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.10000000149011612, 0.14881786704063416, 0.0, 0.10000000149011612, 0.6189189553260803, 0.0, 0.0, 0.10000000149011612, 0.31981536746025085, 0.8910924196243286, 0.0, 0.4766182005405426, 0.4325603246688843, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.28981778025627136, 0.8277879357337952, 0.20515458285808563, 0.6416895985603333, 0.14285455644130707, 0.17410218715667725, 0.2202855944633484, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.15609095990657806, 0.0, 0.15758636593818665, 0.0, 0.0, 0.10000000149011612, 0.0, 0.5368680357933044, 0.0, 0.11928918957710266, 0.0, 0.19300632178783417, 0.23811395466327667, 0.3092346489429474, 0.14267076551914215, 0.2891644835472107, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.58527010679245, 0.13535785675048828, 0.0, 0.10000000149011612, 0.26501360535621643, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.24978268146514893, 0.10000000149011612, 0.0, 0.29822689294815063, 0.10000000149011612, 0.0, 0.6000627279281616, 0.0, 0.25502556562423706, 0.41930145025253296, 0.39881575107574463, 0.0, 0.0, 0.10000000149011612, 0.4778909683227539, 0.0, 0.0, 0.2250843048095703, 0.0, 0.0, 0.0, 0.0, 0.23389945924282074, 0.7786751389503479, 0.25851497054100037, 0.7273840308189392, 0.0, 0.15863604843616486, 0.0, 0.11903084069490433, 0.0, 0.10000000149011612, 0.10000000149011612, 0.4820198714733124, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.5030406713485718, 0.43483737111091614, 0.14714232087135315, 0.0, 0.17900605499744415, 0.6773355007171631, 0.10000000149011612, 0.11912427842617035, 0.838371217250824, 0.10000000149011612, 0.3547966480255127, 0.7231807708740234, 0.12829771637916565, 0.10000000149011612, 0.457599014043808, 0.10000000149011612, 0.0, 0.18943168222904205, 0.0, 0.18944327533245087, 0.4634808301925659, 0.14440664649009705, 0.0, 0.2512175142765045, 0.4111657738685608, 0.0, 0.10000000149011612, 0.0, 0.1316356658935547, 0.523872971534729, 0.5184508562088013, 0.0, 0.3360793888568878, 0.0, 0.37437620759010315, 0.10000000149011612, 0.0, 0.10000000149011612, 0.705729067325592, 0.10000000149011612, 0.2458563596010208, 0.0, 0.32685694098472595, 0.10000000149011612, 0.1198243573307991, 0.10000000149011612, 0.18562209606170654, 0.10000000149011612, 0.3186267018318176, 0.6355257630348206, 0.4157056212425232, 0.10000000149011612, 0.2796652913093567, 0.0, 0.18649940192699432, 0.7311310768127441, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.32508236169815063, 0.10000000149011612, 0.0, 0.154074028134346, 0.0, 0.10000000149011612, 0.8324829339981079, 0.452542245388031, 0.17531710863113403, 0.17878353595733643, 0.0, 0.0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_47", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_47", "inbound_nodes": [["tf.math.subtract_47", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_47", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_47", "inbound_nodes": [["tf.math.pow_47", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_47", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_47", "inbound_nodes": [["tf.math.reduce_sum_47", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_47", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_47", "inbound_nodes": [["tf.math.reduce_mean_47", 0, 0, {"y": 3.592578065395355e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_47", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_47", "inbound_nodes": [[["tf.__operators__.add_47", 0, 0, {}]]]}], "input_layers": [["input_48", 0, 0]], "output_layers": [["tf.math.reduce_sum_47", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}