{"class_name": "Functional", "config": {"name": "model_68", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_46"}, "name": "input_46", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_297", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_297", "inbound_nodes": [[["input_46", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_298", "trainable": true, "dtype": "float32", "units": 720, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_298", "inbound_nodes": [[["dense_297", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_229", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_229", "inbound_nodes": [[["dense_298", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_229", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_45", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_45", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.0, 0.20630230009555817, 0.0, 0.10000000149011612, 0.823458194732666, 0.0, 0.0, 0.10000000149011612, 0.41193366050720215, 1.1946922540664673, 0.0, 0.6255158185958862, 0.5726537704467773, 0.0, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.38074278831481934, 1.1038283109664917, 0.26934701204299927, 0.8510315418243408, 0.19574417173862457, 0.23558560013771057, 0.2894698679447174, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.18802469968795776, 0.0, 0.2040199339389801, 0.0, 0.0, 0.10297753661870956, 0.0, 0.7171714305877686, 0.0, 0.1616414189338684, 0.0, 0.2577280104160309, 0.30608367919921875, 0.3972826302051544, 0.20706406235694885, 0.39582374691963196, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.7785369157791138, 0.1665007472038269, 0.0, 0.10000000149011612, 0.3552767038345337, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.3311249911785126, 0.10000000149011612, 0.0, 0.4105134904384613, 0.0, 0.0, 0.7965560555458069, 0.0, 0.34880903363227844, 0.5481018424034119, 0.5244006514549255, 0.0, 0.0, 0.10000000149011612, 0.6276469230651855, 0.0, 0.0, 0.300712525844574, 0.0, 0.0, 0.0, 0.0, 0.3194393515586853, 1.052485704421997, 0.3385165333747864, 0.9743432402610779, 0.0, 0.21306227147579193, 0.0, 0.15823490917682648, 0.0, 0.10000000149011612, 0.10000000149011612, 0.6348355412483215, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.6780150532722473, 0.5694112181663513, 0.20104548335075378, 0.0, 0.24558086693286896, 0.8814230561256409, 0.10000000149011612, 0.15442876517772675, 1.1004639863967896, 0.10000000149011612, 0.46952784061431885, 0.9680247902870178, 0.16162119805812836, 0.10000000149011612, 0.606450080871582, 0.10000000149011612, 0.0, 0.2552343010902405, 0.0, 0.24471800029277802, 0.6089974045753479, 0.19208943843841553, 0.0, 0.32853901386260986, 0.5417639017105103, 0.0, 0.10000000149011612, 0.0, 0.17826047539710999, 0.6841662526130676, 0.6754854321479797, 0.0, 0.4309889078140259, 0.0, 0.4949299395084381, 0.10000000149011612, 0.0, 0.10000000149011612, 0.9416071772575378, 0.10000000149011612, 0.3270091712474823, 0.0, 0.4244239926338196, 0.12827162444591522, 0.15827588737010956, 0.10000000149011612, 0.24601534008979797, 0.10000000149011612, 0.42578044533729553, 0.8413694500923157, 0.555370032787323, 0.10000000149011612, 0.35182255506515503, 0.0, 0.2620337903499603, 0.9608717560768127, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.42699751257896423, 0.10000000149011612, 0.0, 0.19797936081886292, 0.0, 0.10000000149011612, 1.0776770114898682, 0.6117905378341675, 0.22712117433547974, 0.22595611214637756, 0.0, 0.0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_45", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_45", "inbound_nodes": [["tf.math.subtract_45", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_45", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_45", "inbound_nodes": [["tf.math.pow_45", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_45", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_45", "inbound_nodes": [["tf.math.reduce_sum_45", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_45", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_45", "inbound_nodes": [["tf.math.reduce_mean_45", 0, 0, {"y": 3.592578065395355e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_45", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_45", "inbound_nodes": [[["tf.__operators__.add_45", 0, 0, {}]]]}], "input_layers": [["input_46", 0, 0]], "output_layers": [["tf.math.reduce_sum_45", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}