{"class_name": "Functional", "config": {"name": "model_74", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_50"}, "name": "input_50", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_323", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_323", "inbound_nodes": [[["input_50", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_324", "trainable": true, "dtype": "float32", "units": 720, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_324", "inbound_nodes": [[["dense_323", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_249", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_249", "inbound_nodes": [[["dense_324", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "net_output", "trainable": true, "dtype": "float32", "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.10000000149011612}}, "kernel_constraint": null, "bias_constraint": null}, "name": "net_output", "inbound_nodes": [[["dropout_249", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.subtract_49", "trainable": true, "dtype": "float32", "function": "math.subtract"}, "name": "tf.math.subtract_49", "inbound_nodes": [["net_output", 0, 0, {"y": [0.0, 0.10000000149011612, 0.11712002009153366, 0.0, 0.10000000149011612, 0.5508845448493958, 0.10000000149011612, 0.0, 0.10000000149011612, 0.2670955955982208, 0.7920081615447998, 0.0, 0.4373321533203125, 0.38656675815582275, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.24716448783874512, 0.7569693326950073, 0.16022707521915436, 0.5763780474662781, 0.11962150782346725, 0.1494460254907608, 0.22006352245807648, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.13830499351024628, 0.0, 0.16477428376674652, 0.0, 0.0, 0.10963524878025055, 0.0, 0.47758248448371887, 0.0, 0.10000000149011612, 0.0, 0.18873301148414612, 0.2537058889865875, 0.29920920729637146, 0.13800747692584991, 0.23951071500778198, 0.10000000149011612, 0.10000000149011612, 0.0, 0.10000000149011612, 0.0, 0.5020151734352112, 0.13369476795196533, 0.0, 0.10000000149011612, 0.25568056106567383, 0.0, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.2167051136493683, 0.10000000149011612, 0.10000000149011612, 0.23826870322227478, 0.10000000149011612, 0.0, 0.5173386335372925, 0.0, 0.21588115394115448, 0.39943355321884155, 0.3356165289878845, 0.0, 0.0, 0.10000000149011612, 0.42563650012016296, 0.0, 0.0, 0.1985769271850586, 0.0, 0.0, 0.10000000149011612, 0.0, 0.24818430840969086, 0.6496310830116272, 0.2695479691028595, 0.6469798684120178, 0.0, 0.12609097361564636, 0.0, 0.10000000149011612, 0.0, 0.10000000149011612, 0.10000000149011612, 0.4328401982784271, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.4596202075481415, 0.41296249628067017, 0.15582497417926788, 0.0, 0.1516106128692627, 0.5989969372749329, 0.10000000149011612, 0.127718985080719, 0.7726081013679504, 0.10000000149011612, 0.3221563398838043, 0.6617569327354431, 0.1313801258802414, 0.10000000149011612, 0.39630600810050964, 0.10000000149011612, 0.10000000149011612, 0.16397562623023987, 0.0, 0.17136453092098236, 0.449967622756958, 0.11844856292009354, 0.0, 0.23946857452392578, 0.34635961055755615, 0.0, 0.10000000149011612, 0.0, 0.1048213541507721, 0.45769500732421875, 0.49884486198425293, 0.0, 0.2768145799636841, 0.0, 0.3192511796951294, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.6093729734420776, 0.10000000149011612, 0.2725137770175934, 0.10000000149011612, 0.34209001064300537, 0.10000000149011612, 0.10000000149011612, 0.10000000149011612, 0.1801326870918274, 0.10000000149011612, 0.28891775012016296, 0.58426833152771, 0.40752285718917847, 0.10000000149011612, 0.2578575909137726, 0.0, 0.15537574887275696, 0.6644359827041626, 0.0, 0.10000000149011612, 0.10000000149011612, 0.0, 0.0, 0.0, 0.0, 0.27946916222572327, 0.10000000149011612, 0.0, 0.16594932973384857, 0.0, 0.10000000149011612, 0.7370824217796326, 0.3641442060470581, 0.13368472456932068, 0.17641621828079224, 0.0, 0.0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.pow_49", "trainable": true, "dtype": "float32", "function": "math.pow"}, "name": "tf.math.pow_49", "inbound_nodes": [["tf.math.subtract_49", 0, 0, {"y": 2, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_sum_49", "trainable": true, "dtype": "float32", "function": "math.reduce_sum"}, "name": "tf.math.reduce_sum_49", "inbound_nodes": [["tf.math.pow_49", 0, 0, {"axis": -1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_49", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_49", "inbound_nodes": [["tf.math.reduce_sum_49", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_49", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_49", "inbound_nodes": [["tf.math.reduce_mean_49", 0, 0, {"y": 3.592578065395355e-05, "name": null}]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_49", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_49", "inbound_nodes": [[["tf.__operators__.add_49", 0, 0, {}]]]}], "input_layers": [["input_50", 0, 0]], "output_layers": [["tf.math.reduce_sum_49", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}